In [1]:
import numpy as np 
import pandas as pd

In [3]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': [
        'East', 'West', 'North', 'South',
        'East', 'West', 'North', 'South',
        'East', 'West',
        'North', 'South',
        'East', 'West', 'North', 'South',
        'East', 'West', 'North', 'South'
    ],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': [
        'John', 'Mary', 'Bob', 'Alice',
        'John', 'Mary', 'Bob', 'Alice',
        'John', 'Mary',
        'Bob', 'Alice',
        'John', 'Mary', 'Bob', 'Alice',
        'John', 'Mary', 'Bob', 'Alice'
    ]
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    629     55   John  January      Q1
1  2023-01-02       B   West    625     33   Mary  January      Q1
2  2023-01-03       C  North    137     43    Bob  January      Q1
3  2023-01-04       D  South    358     52  Alice  January      Q1
4  2023-01-05       A   East    423     13   John  January      Q1
5  2023-01-06       B   West    988     40   Mary  January      Q1
6  2023-01-07       C  North    191     83    Bob  January      Q1
7  2023-01-08       D  South    967     57  Alice  January      Q1
8  2023-01-09       A   East    166     26   John  January      Q1
9  2023-01-10       B   West    594     24   Mary  January      Q1
10 2023-01-11       C  North    715     68    Bob  January      Q1
11 2023-01-12       D  South    248     55  Alice  January      Q1
12 2023-01-13       A   East    197     74   John  January      Q1
13 2023-01-14       B   West    133     65   Mary  January      Q1
14 2023-01-15       C  North    885     39    Bob  January      Q1
15 2023-01-16       D  South    781     82  Alice  January      Q1
16 2023-01-17       A   East    433     38   John  January      Q1
17 2023-01-18       B   West    658     64   Mary  January      Q1
18 2023-01-19       C  North    358     38    Bob  January      Q1
19 2023-01-20       D  South    101     95  Alice  January      Q1

In [6]:
pd.pivot_table(df,values='Sales',index='Region',columns='Product',aggfunc='median')

Product      A      B      C      D
Region
East     423.0    NaN    NaN    NaN
North      NaN    NaN  358.0    NaN
South      NaN    NaN    NaN  358.0
West       NaN  625.0    NaN    NaN

In [7]:
pd.pivot_table(df,values=['Sales','Units'],index='Region',columns='Product')

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     369.6    NaN    NaN    NaN  41.2   NaN   NaN   NaN
North      NaN    NaN  457.2    NaN   NaN   NaN  54.2   NaN
South      NaN    NaN    NaN  491.0   NaN   NaN   NaN  68.2
West       NaN  599.6    NaN    NaN   NaN  45.2   NaN   NaN